In [1]:
import os
from pathlib import Path
import xmlrpc.client
import pandas as pd
from sqlalchemy import create_engine

In [2]:
def api_params_func(test_db: bool = False) -> dict:

    api_url = os.environ.get('ODOO_URL_API')
    api_db = os.environ.get('ODOO_DB_API')
    api_test_db = os.environ.get('ODOO_DB_PRUEBA_API')
    api_username = os.environ.get('ODOO_USERNAME_API')
    api_clave = os.environ.get('ODOO_CLAVE_API')


    api_params = {}
    if test_db:
        api_params['api_db'] = api_test_db
    else:
        api_params['api_db'] = api_db


    common = xmlrpc.client.ServerProxy(f'{api_url}/xmlrpc/2/common')
    uid = common.authenticate(api_params['api_db'], api_username, api_clave, {})
    models = xmlrpc.client.ServerProxy(f'{api_url}/xmlrpc/2/object')


    api_params['api_clave'] = api_clave
    api_params['api_uid'] = uid
    api_params['api_models'] = models

    return api_params

In [3]:
def search_costo_ventas_func(mes: int, tolerance: list) -> list[str]:
    
    if type(mes) != int or mes < 1 or mes > 12:
        raise Exception (f'El mes es incorrecto. El párametro "mes" debe ser un número entero entre 1 y 12. Escribiste: {mes}')
    
    if type(tolerance) != list or len(tolerance) != 2:
        raise Exception (f'La tolerancia debe ser una lista de sólo dos elementos')

    if type(tolerance[0]) != int or type(tolerance[1]) != int:
        raise Exception (f'Los elementos de la lista de tolerancia deben ser sólo números tipo enteros')
    
    param_dia_hr_ini = pd.Timestamp(2024, mes, 1) + pd.Timedelta(hours=7)
    param_dia_hr_fin = pd.Timestamp(2024, mes+1, 1) + pd.Timedelta(hours=7) - pd.Timedelta(seconds= 1)
    
    param_dia_hr_ini_tolerance = param_dia_hr_ini - pd.Timedelta(days = tolerance[0])
    param_dia_hr_fin_tolerance = param_dia_hr_fin + pd.Timedelta(days = tolerance[1])
    
    search_costo_ventas = [
        "&", "&",
            ("state", "in", ["purchase", "done"]),
            ("date_approve", ">=", param_dia_hr_ini_tolerance.strftime('%Y-%m-%d %H:%M:%S')),
            ("date_approve", "<=", param_dia_hr_fin_tolerance.strftime('%Y-%m-%d %H:%M:%S')),
        ]

    return search_costo_ventas

In [4]:
def mes_to_string_func(mes: int) -> str:
    
    if type(mes) != int or mes < 1 or mes > 12:
        raise Exception (f'El mes es incorrecto. El párametro "mes" debe ser un número entero entre 1 y 12. Escribiste: {mes}')
    
    match mes:
        case 1:
            mes_to_string = 'enero'
        case 2:
            mes_to_string = 'febrero'
        case 3:
            mes_to_string = 'marzo'
        case 4:
            mes_to_string = 'abril'
        case 5:
            mes_to_string = 'mayo'
        case 6:
            mes_to_string = 'junio'
        case 7:
            mes_to_string = 'julio'
        case 8:
            mes_to_string = 'agosto'
        case 9:
            mes_to_string = 'septiembre'
        case 10:
            mes_to_string = 'octubre'
        case 11:
            mes_to_string = 'noviembre'
        case 12:
            mes_to_string = 'diciembre'

    return mes_to_string

In [5]:
def get_dfs_from_database(db_mode: str, mes_to_string:str) -> list[pd.DataFrame]:
    
    if db_mode.lower() == 'local':
    
        db_file_path_str = str(Path().cwd().parent.parent.joinpath(f'data/comisiones.db'))
        engine = create_engine(f'sqlite:///{db_file_path_str}')

        with engine.connect() as conn, conn.begin():
            ventas = pd.read_sql_table(f'ventas_{mes_to_string}', conn, dtype_backend='numpy_nullable')
            try:
                ultimo_costo = pd.read_sql_table(f'ultimo_costo_{mes_to_string}', conn, dtype_backend='numpy_nullable')
            except:
                ultimo_costo = None

        engine.dispose()
    

    elif db_mode.lower() != 'local':
        raise Exception (f'Sólo existe la base de datos "Local"')


    return ventas, ultimo_costo

In [6]:
def _get_df_from_excel(file_name:str, file_sheet:str, file_location:str) -> pd.DataFrame:

    file_path_str = str(Path().cwd().parent.parent.joinpath(f'data/{file_location}/{file_name}'))
    df = pd.read_excel(file_path_str, sheet_name=file_sheet, dtype_backend='numpy_nullable')

    return df

In [7]:
def prov_locales_df_from_excel() -> list[pd.DataFrame]:
    
    file_name = 'proveedores_oficiales.xlsx'
    file_sheet = 'Hoja1'
    file_location = 'compras'

    df = _get_df_from_excel(file_name, file_sheet, file_location)

    prov_oficiales = df.loc[df['oficial'] == 1][['partner_id', 'partner_name']]
    prov_locales = df.loc[df['oficial'] == 0][['partner_id', 'partner_name']]

    return prov_oficiales, prov_locales

In [8]:
def ultimo_costo_sae_df_from_excel() -> list[pd.DataFrame]:
    
    file_name = 'ultimo_costo_sae.xlsx'
    file_sheet = 'Hoja1'
    file_location = 'costo_ventas'

    df = _get_df_from_excel(file_name, file_sheet, file_location)

    return df

In [9]:
def calificados_fase_c_df_from_excel() -> list[pd.DataFrame]:

    file_name = 'calificados_fase_c.xlsx'
    file_sheet = 'Hoja1'
    file_location = 'costo_ventas'

    df = _get_df_from_excel(file_name, file_sheet, file_location)

    # Check que verifica que todas las líneas de compra estén calificadas
    if pd.NA in df['calificacion'].unique():
        print('¡Cuidado!, tienes líneas de compras "line_id" sin calificar')
        return None
    
    df['calificacion'] = df['calificacion'].str.upper()
    calificados_fase_c_OK = df.loc[df['calificacion'] == 'OK'] # Líneas 'line_id' que tienen un match con 'fact_line_id'
    calificados_fase_c_B = df.loc[df['calificacion'] == 'B'] # Líneas para regresar a la fase B y que el algoritmo las catalogue.
    calificados_fase_c_C = df.loc[df['calificacion'] == 'C'] # Líneas para regresar a la fase C y que el humano las catalogue.
    calificados_fase_c_D = df.loc[df['calificacion'] == 'D'] # Líneas para que el algoritmo fase D (final) las catalogue.
    calificados_fase_c_E = df.loc[df['calificacion'] == 'E'] # Líneas para eliminar, la observación tiene el por qué.


    return calificados_fase_c_OK, calificados_fase_c_B, calificados_fase_c_C, calificados_fase_c_D, calificados_fase_c_E

In [10]:
def repetidos_match_1ro_df_from_excel(mes:int) -> list[pd.DataFrame]:

    file_name = f'{mes}_costo_ventas.xlsx'
    file_sheet = 'repetidos_match_1ro'
    file_location = 'costo_ventas'

    df = _get_df_from_excel(file_name, file_sheet, file_location)

    return df

In [11]:
def api_call_purchase_doc_func(api_params: dict, search_costo_ventas: list[str] ) -> list[int, dict]:
    
    api_db = api_params['api_db']
    api_clave = api_params['api_clave']
    uid = api_params['api_uid']
    models = api_params['api_models']

    purchase_doc_fields = [
                    'name',
                    'state',
                    'partner_id',
                    'partner_ref',
                    'date_approve',
                    'x_fecha_factura',
                    'user_id',
                    'create_uid'
                    ]

    purchase_doc_ids = models.execute_kw(api_db, uid, api_clave, 'purchase.order', 'search', [search_costo_ventas])
    purchase_doc_json = models.execute_kw(api_db, uid, api_clave, 'purchase.order', 'read', [purchase_doc_ids], {'fields': purchase_doc_fields})
    
    return purchase_doc_ids, purchase_doc_json

In [12]:
def purchase_doc_func(purchase_doc_json: list[dict], prov_oficiales:pd.DataFrame) -> pd.DataFrame:

    purchase_doc_data = []

    for compra in purchase_doc_json:
        new = {}
        new['order_id'] = compra['id']
        new['order_name'] = compra['name']
        new['order_state'] = compra['state']
        new['order_date'] = compra['date_approve'] if compra['date_approve'] else pd.NA
        new['partner_id'] = compra['partner_id'][0]
        new['partner_name'] = compra['partner_id'][1]
        new['partner_fact_ref'] = compra['partner_ref']
        new['partner_fact_date'] = compra['x_fecha_factura'] if compra['x_fecha_factura'] else pd.NA
        new['capturista'] = compra['create_uid'][1] if compra['create_uid'] else pd.NA
        new['vendedora'] = compra['user_id'][1] if compra['user_id'] else pd.NA

        purchase_doc_data.append(new)

    compras_doc = pd.DataFrame(purchase_doc_data)
    compras_doc['order_date'] = pd.to_datetime(compras_doc['order_date'], format='%Y-%m-%d %H:%M:%S')
    compras_doc['partner_fact_date'] = pd.to_datetime(compras_doc['partner_fact_date'], format='%Y-%m-%d')
    compras_doc['oficial'] = compras_doc['partner_id'].isin(prov_oficiales['partner_id'])

    return compras_doc

In [13]:
def api_call_purchase_line_func(api_params: dict, purchase_doc_ids: list[int]) -> list[dict]:
    
    api_db = api_params['api_db']
    api_clave = api_params['api_clave']
    uid = api_params['api_uid']
    models = api_params['api_models']

    purchase_line_fields = [
                        'order_id',
                        'date_approve',
                        'partner_id',
                        'product_id',
                        'product_qty',
                        'price_unit_discounted'
                        ]

    purchase_line_ids = models.execute_kw(api_db, uid, api_clave, 'purchase.order.line', 'search', [[("order_id.id", "in", purchase_doc_ids)]])
    purchase_line_json = models.execute_kw(api_db, uid, api_clave, 'purchase.order.line', 'read', [purchase_line_ids], {'fields': purchase_line_fields})
    
    return purchase_line_json

In [14]:
def purchase_line_func(purchase_line_json: list[dict]) -> pd.DataFrame:
    
    purchase_line_data = []

    for line in purchase_line_json:
        new = {}
        new['line_id'] = line['id']
        new['order_id'] = line['order_id'][0]
        new['order_name'] = line['order_id'][1]
        new['order_date'] = line['date_approve'] if line['date_approve'] else pd.NA
        new['partner_id'] = line['partner_id'][0]
        new['partner_name'] = line['partner_id'][1]
        new['product_id_pp'] = line['product_id'][0]
        new['product_name'] = line['product_id'][1]
        new['product_qty'] = line['product_qty']
        new['product_cost'] = line['price_unit_discounted']
        
        purchase_line_data.append(new)

    compras_line = pd.DataFrame(purchase_line_data)
    compras_line['order_date'] = pd.to_datetime(compras_line['order_date'], format='%Y-%m-%d %H:%M:%S')

    return compras_line

In [15]:
def compras_func(compras_doc:pd.DataFrame, compras_line:pd.DataFrame, ultimo_costo:pd.DataFrame) -> pd.DataFrame:
    
    compras_odoo = pd.merge(
                    compras_line,
                    compras_doc[['order_id', 'partner_fact_ref', 'partner_fact_date', 'capturista', 'vendedora']], 
                    how='left', 
                    on='order_id'
                )

    compras_odoo['order_date'] = compras_odoo['order_date'].dt.normalize()

    cols_to_Int64 = ['line_id', 'order_id', 'partner_id', 'product_id_pp']
    compras_odoo[cols_to_Int64] = compras_odoo[cols_to_Int64].astype('Int64')

    compras_odoo['product_qty'] = compras_odoo['product_qty'].astype('Float64')
    compras_odoo['vendedora'] = compras_odoo['vendedora'].convert_dtypes()

    compras = pd.concat([compras_odoo, ultimo_costo])

    return compras, compras_odoo

# Pruebas

In [16]:
mes = 1

api_params = api_params_func()
search_costo_ventas = search_costo_ventas_func(mes, tolerance=[0,0])
mes_to_string = mes_to_string_func(mes)

ventas, ultimo_costo = get_dfs_from_database('local', mes_to_string)

prov_oficiales, prov_locales = prov_locales_df_from_excel()

if not ultimo_costo:
    ultimo_costo = ultimo_costo_sae_df_from_excel()
calificados_fase_c_OK, calificados_fase_c_B, calificados_fase_c_C, calificados_fase_c_D, calificados_fase_c_E = calificados_fase_c_df_from_excel()

purchase_doc_ids, purchase_doc_json = api_call_purchase_doc_func(api_params, search_costo_ventas)
purchase_line_json = api_call_purchase_line_func(api_params, purchase_doc_ids)

compras_doc = purchase_doc_func(purchase_doc_json, prov_oficiales)
compras_line = purchase_line_func(purchase_line_json)
compras, compras_odoo = compras_func(compras_doc, compras_line, ultimo_costo)

# Checks

In [17]:
# Línea para comprobrar que el 100% de los proveedores de Odoo están calificados en la lista de proveedores oficiales

check1 = (compras_doc[~compras_doc['partner_id'].isin(pd.concat([prov_locales, prov_oficiales])['partner_id'])]).drop_duplicates('partner_id')

if not check1.empty:
    print('Hay proveedores no calificados')
    display(check1)

else:
    print('Todo correcto con check1')

Todo correcto con check1

In [18]:
from IPython.display import display

check_costo_venta = (
    pd.merge_asof(
        left = ventas.sort_values('invoice_date'),
        right = compras.sort_values('order_date'), 
        
        left_by = 'product_id', 
        right_by = 'product_id_pp', 
        
        left_on = 'invoice_date', 
        right_on = 'order_date', 

        direction = 'backward')
)

check2 = check_costo_venta[check_costo_venta['product_cost'].isna()][['product_id', 'product_name_x']]

print(f'Hay {len(check2)} renglones sin costo de la venta.')

if not check2.empty:
    print('Los productos sin costo son los siguientes:')
    display(check2.drop_duplicates('product_id'))

else:
    print('Todo correcto con check2')

Hay 0 renglones sin costo de la venta.
Todo correcto con check2

# Desarrollo del código

In [19]:
cols_vent = ['fact_doc_id',
 'name',
 'invoice_date',
 'fact_line_id',
 'quantity',
 'price_unit',
 'salesperson_name',
 'product_id',
 'product_name']

In [95]:
repetidos_match_1ro = repetidos_match_1ro_df_from_excel(mes)


lista_capturistas = [
       'Elsa Ivette Diaz Leyva',
       'Alexa Yadira Mazariegos Zunun',
       'Dulce Guadalupe Pedroza Valenzuela',
       'Mariana Araceli Carvajal Flores',
       'Rosario Martinez Zarate'
]

# Compras especiales que no son de proveedores oficiales
compras_especiales = compras_odoo.loc[
            (~compras_odoo['vendedora'].isin(lista_capturistas))
            & (~compras_odoo['partner_id'].isin(prov_oficiales['partner_id']))
            ]

compras_especiales_after_repetidos = compras_especiales.loc[
            ~compras_especiales['line_id'].isin(repetidos_match_1ro['line_id'])
            ]

ventas_after_repetidos = ventas.loc[
            ~ventas['fact_line_id'].isin(repetidos_match_1ro['fact_line_id'])
            ]

In [96]:
match_1_merge = (
    pd.merge_asof(
        left = compras_especiales_after_repetidos.sort_values('order_date'), 
        right = ventas_after_repetidos.sort_values('invoice_date'),
        
        left_by = ['product_id_pp', 'vendedora', 'product_qty'], 
        right_by = ['product_id', 'salesperson_name', 'quantity'], 
        
        left_on = 'order_date', 
        right_on = 'invoice_date', 

        direction = 'nearest',
        tolerance = pd.Timedelta(days=3))
)

In [97]:
ids_ventas_repetidas_por_corregir = match_1_merge.loc[(~match_1_merge['fact_line_id'].isna()) & (match_1_merge['fact_line_id'].duplicated()), 'fact_line_id']

if not ids_ventas_repetidas_por_corregir.empty:

    cols = [
        'line_id', 'fact_line_id', '.',
        'order_name', 'order_date', 'partner_name_x', 'partner_fact_ref', 'partner_fact_date',  'product_qty',
        'product_cost', 'vendedora', 'product_id_pp', 'product_name_x', '.',
        'fact_doc_id', 'name', 'invoice_date', 'partner_name_y', 'quantity', 'salesperson_name', 'price_unit', 'discount',]


    
    repetidos_match_1ro_por_corregir = match_1_merge.loc[match_1_merge['fact_line_id'].isin(ids_ventas_repetidas_por_corregir)].reset_index()
    repetidos_match_1ro_por_corregir.loc[:,'.'] = pd.NA

    archivo = 'repetidos_match_1ro_por_corregir.xlsx'
    desktop_path = Path.home().joinpath(f'Desktop/{archivo}')
    repetidos_match_1ro_por_corregir[cols].to_excel(desktop_path)
    print(f'¡Alto! tienes "fact_line_id" repetidas. \nSe generó un archivo excel en tu escritorio llamado "{archivo}" para que corrijas la información.')

else:
    print('No hay ningún "fact_line_id" repetido en el primer match. Puedes continuar...')

No hay ningún "fact_line_id" repetido en el primer match. Puedes continuar...

In [98]:
# Match resultantes del 1er match.
match_1 = match_1_merge.loc[~match_1_merge['fact_line_id'].isna(), ['line_id', 'fact_line_id']]

# Después de correr el 1er match, las ventas restantes
ventas_after_match_1 = ventas_after_repetidos.loc[
                                        ~ventas_after_repetidos['fact_line_id'].isin(match_1['fact_line_id'])
                                    ]

# Después de correr el 1er match, las compras que tienen un product_id que sí existe en las ventas restantes.
compras_especiales_after_match_1 = compras_especiales_after_repetidos.loc[
                                                        (~compras_especiales_after_repetidos['line_id'].isin(match_1['line_id']))
                                                        & (compras_especiales_after_repetidos['product_id_pp'].isin(ventas_after_match_1['product_id']))
                                                    ]

# Resto de las compras especiales. Estan no tienen un product_id que existe en las ventas restantes y no se pueden merchar.
compras_especiales_sin_ventas = compras_especiales_after_repetidos.loc[
                                                        (~compras_especiales_after_repetidos['line_id'].isin(match_1['line_id']))
                                                        & (~compras_especiales_after_repetidos['product_id_pp'].isin(ventas_after_match_1['product_id']))
                                                    ]

In [99]:
match_2 = pd.DataFrame([], columns=['line_id','fact_line_id'])

for i in range(len(compras_especiales_after_match_1)):
    
    linea_compra = compras_especiales_after_match_1.sort_values('order_date').iloc[i]

    mini_df = ventas_after_match_1.loc[
                (~ventas_after_match_1['fact_line_id'].isin(match_2['fact_line_id']))
                & (ventas_after_match_1['salesperson_name'] == linea_compra['vendedora'])
                & (ventas_after_match_1['product_id'] == linea_compra['product_id_pp'])
                # & (ventas_after_match_1['invoice_date'] >= linea_compra['order_date'] - pd.Timedelta(days=5))
                # & (ventas_after_match_1['invoice_date'] <= linea_compra['order_date'] + pd.Timedelta(days=5))
            ]
    
    if not mini_df.empty:
        df_copia = mini_df.copy()
        df_copia['diff'] = abs(df_copia['invoice_date'] - linea_compra['order_date'])
        df_sort = df_copia.sort_values('diff').reset_index()
        df_sort['cumsum'] = df_sort['quantity'].cumsum()
        index = df_sort[df_sort['cumsum'] == linea_compra['product_qty']].index[0] if not df_sort[df_sort['cumsum'] == linea_compra['product_qty']].index.empty else None
        if index != None:
            df_sort.loc[:index , 'line_id'] = linea_compra['line_id']

            if match_2.empty:
                match_2 = df_sort.loc[~df_sort['line_id'].isna(), ['line_id','fact_line_id']].copy()
            else:
                match_2 = pd.concat([
                            match_2, 
                            df_sort.loc[~df_sort['line_id'].isna(), ['line_id','fact_line_id']],
                        ])
            
        else:    
            df_sort.loc[:index , 'line_id'] = pd.NA

In [100]:
# Después de correr el 2do match, las ventas restantes
ventas_after_match_2 = ventas_after_match_1.loc[
                                        ~ventas_after_match_1['fact_line_id'].isin(match_2['fact_line_id'])
                                    ]

# Después de correr el 2do match, las compras restantes.
compras_especiales_after_match_2 = compras_especiales_after_match_1.loc[
                                            ~compras_especiales_after_match_1['line_id'].isin(match_2['line_id'])
                                        ]

In [66]:
match_3 = (
    pd.merge_asof(
        left = compras_especiales_after_match_2.sort_values('order_date'), 
        right = ventas_after_match_2.sort_values('invoice_date'),
        
        left_by = ['product_id_pp', 'vendedora', 'product_qty'], 
        right_by = ['product_id', 'salesperson_name', 'quantity'], 
        
        left_on = 'order_date', 
        right_on = 'invoice_date', 

        direction = 'nearest',
        tolerance = pd.Timedelta(days=3))
)

In [68]:
match_3[~match_3['fact_line_id'].isna()]

Empty DataFrame
Columns: [line_id, order_id, order_name, order_date, partner_id_x, partner_name_x, product_id_pp, product_name_x, product_qty, product_cost, partner_fact_ref, partner_fact_date, capturista, vendedora, fact_doc_id, name, invoice_date, state, invoice_origin, module_origin, pos_doc_id, move_type, reversal_move_id, reversed_entry_id, journal_id, company_id, partner_id_y, partner_name_y, salesperson_id, salesperson_name, active, sale_team_id, sale_team_description, business_model, warehouse, fact_line_id, product_id, product_name_y, prod_codigo, prod_linea, quantity, price_unit, discount, price_subtotal]
Index: []

[0 rows x 44 columns]

In [ ]:
match_4 = pd.DataFrame([], columns=['line_id','fact_line_id'])

for i in range(len(compras_especiales_after_match_2)):
    
    linea_compra = compras_especiales_after_match_2.sort_values('order_date').iloc[i]

    mini_df = ventas_after_match_2.loc[
                (~ventas_after_match_2['fact_line_id'].isin(match_4['fact_line_id']))
                # & (ventas_after_match_2['salesperson_name'] == linea_compra['vendedora'])
                & (ventas_after_match_2['product_id'] == linea_compra['product_id_pp'])
                # & (ventas_after_match_2['invoice_date'] >= linea_compra['order_date'] - pd.Timedelta(days=5))
                # & (ventas_after_match_2['invoice_date'] <= linea_compra['order_date'] + pd.Timedelta(days=5))
            ]
    
    print(f"-----> línea de compra {linea_compra['line_id']}")
    print(f"Compra:")
    display(compras_especiales_after_match_2[compras_especiales_after_match_2['line_id'] == linea_compra['line_id']])
    print(f"Ventas mini_df")
    display(mini_df[cols_vent])
    print(f"\n\n")

    # if not mini_df.empty:
    #     df_copia = mini_df.copy()
    #     df_copia['diff'] = abs(df_copia['invoice_date'] - linea_compra['order_date'])
    #     df_sort = df_copia.sort_values('diff').reset_index()
    #     df_sort['cumsum'] = df_sort['quantity'].cumsum()
    #     index = df_sort[df_sort['cumsum'] == linea_compra['product_qty']].index[0] if not df_sort[df_sort['cumsum'] == linea_compra['product_qty']].index.empty else None
    #     if index != None:
    #         df_sort.loc[:index , 'line_id'] = linea_compra['line_id']

    #         if match_4.empty:
    #             match_4 = df_sort.loc[~df_sort['line_id'].isna(), ['line_id','fact_line_id']].copy()
    #         else:
    #             match_4 = pd.concat([
    #                         match_4, 
    #                         df_sort.loc[~df_sort['line_id'].isna(), ['line_id','fact_line_id']],
    #                     ])
            
    #     else:    
    #         df_sort.loc[:index , 'line_id'] = pd.NA

In [122]:
ids_prod = compras_especiales_after_match_2['product_id_pp'].unique()

for prod in ids_prod:
    
    mini_df = ventas_after_match_2.loc[
                (ventas_after_match_2['product_id'] == prod)
            ]
    
    print(f"-----> product_id {prod}")
    print(f"Compra:")
    display(compras_especiales_after_match_2[compras_especiales_after_match_2['product_id_pp'] == prod])
    print(f"Ventas mini_df")
    display(mini_df[cols_vent])
    print(f"\n\n")

-----> product_id 13786
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
0,1812,498,P00487 (SJCFCO 2727),2024-01-31,5326,Madereria El Pino De Los Cabos,13786,"[13538] Tabla Americana 1"" X 12"" X 16' *13538*",1.0,537.93,SJCFCO 2727,NaT,<NA>,Mayra Angelica Parada Manjarrez
1157,541,197,P00186 (A 103781),2024-01-13,5352,Luz Raquel Rodriguez Montoya,13786,"[13538] Tabla Americana 1"" X 12"" X 16' *13538*",5.0,524.14,A 103781,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
3644,5961,F1-VS/2024/00148,2024-01-12,21835,5.0,806.9,Yamilet Blanco Salas,13786,"Tabla Americana 1"" X 12"" X 16' *13538*"

-----> product_id 28276
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
4,1807,496,P00485 (W0000459056),2024-01-31,5157,Ferre-Pat,28276,[1111] Candado Phillips #113 Gl C#45 *1111*,10.0,90.31,W0000459056,NaT,<NA>,Mayra Angelica Parada Manjarrez
303,1500,454,P00443 (C 261746),2024-01-29,5321,El Gran Tlapalero,28276,[1111] Candado Phillips #113 Gl C#45 *1111*,1.0,87.03,C 261746,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
9064,14425,F2-VS/2024/00208,2024-01-27,54162,1.0,336.37,Yamilet Blanco Salas,28276,Candado Phillips #113 Gl C#45 *1111*

-----> product_id 27920
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
5,1808,496,P00485 (W0000459056),2024-01-31,5157,Ferre-Pat,27920,[20476] Dis. Austromex 4 1/2 x 3/64 x 7/8 #750...,40.0,40.13,W0000459056,NaT,<NA>,Mayra Angelica Parada Manjarrez
129,1683,480,P00469 (W0000460284),2024-01-30,5157,Ferre-Pat,27920,[20476] Dis. Austromex 4 1/2 x 3/64 x 7/8 #750...,50.0,40.13,W0000460284,NaT,<NA>,Irma Carvajal Flores
960,770,280,P00269 (W0000457956),2024-01-18,5157,Ferre-Pat,27920,[20476] Dis. Austromex 4 1/2 x 3/64 x 7/8 #750...,10.0,53.90,W0000457956,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
5673,8988,F1-VS/2024/00227,2024-01-18,33526,50.0,73.5,Mayra Angelica Parada Manjarrez,27920,Dis. Austromex 4 1/2 x 3/64 x 7/8 #750 *20476*

-----> product_id 14201
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
299,1507,456,P00445 (F 303629),2024-01-29,5262,Chapas Y Maderas Importadas,14201,[27002] Bisagra Tectus 240 3D Gris #274.100 (P...,60.0,763.53,F 303629,NaT,<NA>,Brenda Luz Acosta Lopez
1304,390,159,P00148 (F 302124),2024-01-11,5262,Chapas Y Maderas Importadas,14201,[27002] Bisagra Tectus 240 3D Gris #274.100 (P...,10.0,757.12,F 302124,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
3141,5126,F2-VS/2024/00071,2024-01-11,18839,10.0,1275.14,Yamilet Blanco Salas,14201,Bisagra Tectus 240 3D Gris #274.100 (Pz) *27002*
9573,15427,F2-VS/2024/00214,2024-01-30,58267,40.0,1275.14,Brenda Luz Acosta Lopez,14201,Bisagra Tectus 240 3D Gris #274.100 (Pz) *27002*

-----> product_id 14263
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
300,1508,456,P00445 (F 303629),2024-01-29,5262,Chapas Y Maderas Importadas,14263,[55894] Bis. Tectus 340 3D 80Kg Negro *55894*,20.0,884.77,F 303629,NaT,<NA>,Brenda Luz Acosta Lopez
430,1335,398,P00387 (F 303424),2024-01-26,5262,Chapas Y Maderas Importadas,14263,[55894] Bis. Tectus 340 3D 80Kg Negro *55894*,40.0,910.27,F 303424,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
2607,4331,F1-VS/2024/00108,2024-01-10,15801,5.0,1901.0,Irma Carvajal Flores,14263,Bis. Tectus 340 3D 80Kg Negro *55894*
8427,13250,F1-VS/2024/00324,2024-01-25,49707,30.0,1500.0,Irma Carvajal Flores,14263,Bis. Tectus 340 3D 80Kg Negro *55894*

-----> product_id 27184
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
302,1499,454,P00443 (C 261746),2024-01-29,5321,El Gran Tlapalero,27184,[25631] Carret. P/Riel Corre 2181300NI Pz *25631*,20.0,16.4,C 261746,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

Empty DataFrame
Columns: [fact_doc_id, name, invoice_date, fact_line_id, quantity, price_unit, salesperson_name, product_id, product_name]
Index: []

-----> product_id 27756
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
310,1496,452,P00441 (A 267),2024-01-29,5227,Anabell Hernandez Espinoza,27756,[22658] Pasta Covermix 509 (19Lt) Resanadora *...,2.0,1938.0,A 267,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

Empty DataFrame
Columns: [fact_doc_id, name, invoice_date, fact_line_id, quantity, price_unit, salesperson_name, product_id, product_name]
Index: []

-----> product_id 27101
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
311,1497,452,P00441 (A 267),2024-01-29,5227,Anabell Hernandez Espinoza,27101,[25952] Pasta Corev Palladio 2343 (19Lt) Plas ...,2.0,5790.52,A 267,NaT,<NA>,Irma Carvajal Flores
1041,664,247,P00236 (A 254),2024-01-16,5227,Anabell Hernandez Espinoza,27101,[25952] Pasta Corev Palladio 2343 (19Lt) Plas ...,2.0,5948.28,A 254,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
7893,12410,F1-VS/2024/00312,2024-01-24,46315,3.0,8017.25,Irma Carvajal Flores,27101,Pasta Corev Palladio 2343 (19Lt) Plas *25952*

-----> product_id 14770
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
315,1492,448,P00437 (WAI 53455),2024-01-29,5175,Cia Sherwin Williams,14770,[101001] Pintura Kem-Tone Mate 711 SW *101001*,1.0,2415.58,WAI 53455,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
5567,8894,F1-VS/2024/00222,2024-01-18,33115,2.0,3623.37,Irma Carvajal Flores,14770,Pintura Kem-Tone Mate 711 SW *101001*

-----> product_id 28291
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
317,1489,446,P00435 (4HGFFI 182762),2024-01-27,5387,Home Depot Mexico,28291,[10819] Cinta D/Montaje 3M D/Espuma Scotch 110...,10.0,275.0,4HGFFI 182762,NaT,Gretel Gómez Alcázar,Brenda Luz Acosta Lopez
1280,418,177,P00166 (4HGFFI 175877),2024-01-12,5387,Home Depot Mexico,28291,[10819] Cinta D/Montaje 3M D/Espuma Scotch 110...,3.0,275.0,4HGFFI 175877,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
3224,5204,F2-VS/2024/00080,2024-01-11,19134,3.0,412.5,Yamilet Blanco Salas,28291,Cinta D/Montaje 3M D/Espuma Scotch 110 *10819*

-----> product_id 14853
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
338,1428,429,P00418 (SJT 15661),2024-01-26,5294,Fierro Y Lamina Construccion,14853,[1371] Carda D/Alambre Trenzado 4 x 5/8 D-3171...,6.0,244.39,SJT 15661,NaT,<NA>,Yolanda Alejandra Rodriguez González

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
8642,13637,F2-CC/2024/01776,2024-01-26,51236,7.0,438.36,Yolanda Alejandra Rodriguez González,14853,Carda D/Alambre Trenzado 4 x 5/8 D-31712 *1371*

-----> product_id 28519
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
339,1427,428,P00417 (2000005323200841B),2024-01-26,5128,Mercado Libre,28519,[1792] Cinta Unión Para Alfombras Sintéticas *...,2.0,474.14,2000005323200841B,NaT,<NA>,Brenda Luz Acosta Lopez
588,1153,349,P00338 (2000005305184095C),2024-01-23,5128,Mercado Libre,28519,[1792] Cinta Unión Para Alfombras Sintéticas *...,1.0,443.97,2000005305184095C,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
8410,13247,F2-VS/2024/00196,2024-01-25,49681,3.0,695.0,Brenda Luz Acosta Lopez,28519,Cinta Unión Para Alfombras Sintéticas *1792*

-----> product_id 14548
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
397,1369,411,P00400 (MPIFCO 1690),2024-01-26,5296,Madereria Pichonchas,14548,[24622] Tabla Teka Nacional 1x8 (Cama) *24622*,1.0,1850.78,MPIFCO 1690,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
8396,13239,F1-VS/2024/00322,2024-01-25,49646,1.0,2806.04,Yamilet Blanco Salas,14548,Tabla Teka Nacional 1x8 (Cama) *24622*

-----> product_id 14184
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
400,1361,408,P00397 (SJCFCO 2196),2024-01-26,5326,Madereria El Pino De Los Cabos,14184,[90057] Tablon americano 2*12*10 *90057*,1.0,758.62,SJCFCO 2196,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
8397,13239,F1-VS/2024/00322,2024-01-25,49647,1.0,1336.21,Yamilet Blanco Salas,14184,Tablon americano 2*12*10 *90057*

-----> product_id 13781
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
401,1362,408,P00397 (SJCFCO 2196),2024-01-26,5326,Madereria El Pino De Los Cabos,13781,"[14145] Tabla Americana 1"" X 12"" X 12' *14145*",2.0,403.45,SJCFCO 2196,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
8401,13239,F1-VS/2024/00322,2024-01-25,49651,2.0,837.7,Yamilet Blanco Salas,13781,"Tabla Americana 1"" X 12"" X 12' *14145*"

-----> product_id 13331
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
402,1363,408,P00397 (SJCFCO 2196),2024-01-26,5326,Madereria El Pino De Los Cabos,13331,[16320] Triplay Birch 1/4 4'*8' *16320*,2.0,267.24,SJCFCO 2196,NaT,<NA>,Irma Carvajal Flores
617,1123,338,P00327 (B 83390),2024-01-22,5290,Maria Reyna Navarrete Cortez,13331,[16320] Triplay Birch 1/4 4'*8' *16320*,3.0,261.09,B 83390,NaT,<NA>,Irma Carvajal Flores
1118,582,220,P00209 (SJCFCO 983),2024-01-15,5326,Madereria El Pino De Los Cabos,13331,[16320] Triplay Birch 1/4 4'*8' *16320*,5.0,267.24,SJCFCO 983,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
8398,13239,F1-VS/2024/00322,2024-01-25,49648,2.0,581.9,Yamilet Blanco Salas,13331,Triplay Birch 1/4 4'*8' *16320*

-----> product_id 13943
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
403,1364,408,P00397 (SJCFCO 2196),2024-01-26,5326,Madereria El Pino De Los Cabos,13943,[15143] Triplay Birch 1/2 4'*8' *15143*,2.0,500.00,SJCFCO 2196,NaT,<NA>,Irma Carvajal Flores
616,1122,338,P00327 (B 83390),2024-01-22,5290,Maria Reyna Navarrete Cortez,13943,[15143] Triplay Birch 1/2 4'*8' *15143*,6.0,536.41,B 83390,NaT,<NA>,Irma Carvajal Flores
1128,575,215,P00204 (B 83363),2024-01-15,5290,Maria Reyna Navarrete Cortez,13943,[15143] Triplay Birch 1/2 4'*8' *15143*,5.0,536.41,B 83363,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
3646,5961,F1-VS/2024/00148,2024-01-12,21837,5.0,846.0,Yamilet Blanco Salas,13943,Triplay Birch 1/2 4'*8' *15143*
8399,13239,F1-VS/2024/00322,2024-01-25,49649,2.0,957.0,Yamilet Blanco Salas,13943,Triplay Birch 1/2 4'*8' *15143*

-----> product_id 14156
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
404,1365,408,P00397 (SJCFCO 2196),2024-01-26,5326,Madereria El Pino De Los Cabos,14156,[15293] Triplay Birch 3/4 4'*8' *15293*,2.0,724.14,SJCFCO 2196,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
8400,13239,F1-VS/2024/00322,2024-01-25,49650,2.0,1540.96,Yamilet Blanco Salas,14156,Triplay Birch 3/4 4'*8' *15293*

-----> product_id 14287
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
405,1366,408,P00397 (SJCFCO 2196),2024-01-26,5326,Madereria El Pino De Los Cabos,14287,[5211] Tabla Alder 1*8 (Cama) *5211*,1.0,965.52,SJCFCO 2196,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
8395,13239,F1-VS/2024/00322,2024-01-25,49645,1.0,2118.09,Yamilet Blanco Salas,14287,Tabla Alder 1*8 (Cama) *5211*

-----> product_id 8019
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
429,1336,399,P00388 (2000005323215311B),2024-01-26,5128,Mercado Libre,8019,[28860] Mascarilla / Respirador KN95 MASC01 ( ...,60.0,3.62,2000005323215311B,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
33,166,F2-CC/2024/00013,2024-01-02,491,37.0,5.4,Angela Carrillo Cárdenas,8019,Mascarilla / Respirador KN95 MASC01 ( 1 pz ) *...
1691,3096,F2-CC/2024/00393,2024-01-08,11337,4.0,5.4,Nadia Santos Nava,8019,Mascarilla / Respirador KN95 MASC01 ( 1 pz ) *...
5011,8192,F2-CC/2024/01043,2024-01-17,30309,63.0,5.4,Angela Carrillo Cárdenas,8019,Mascarilla / Respirador KN95 MASC01 ( 1 pz ) *...
5290,8457,F2-CC/2024/01082,2024-01-17,31288,100.0,5.4,Karla Jaqueline Rivera Hernández,8019,Mascarilla / Respirador KN95 MASC01 ( 1 pz ) *...
8403,13239,F1-VS/2024/00322,2024-01-25,49653,50.0,5.4,Yamilet Blanco Salas,8019,Mascarilla / Respirador KN95 MASC01 ( 1 pz ) *...
8656,13651,F2-CC/2024/01778,2024-01-26,51289,4.0,5.4,Patricia Flores Pantaleón,8019,Mascarilla / Respirador KN95 MASC01 ( 1 pz ) *...
8777,13864,F2-CC/2024/01814,2024-01-26,51977,26.0,5.4,Karla Jaqueline Rivera Hernández,8019,Mascarilla / Respirador KN95 MASC01 ( 1 pz ) *...

-----> product_id 12677
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
546,1198,376,P00365 (4HGFFI 181137),2024-01-24,5387,Home Depot Mexico,12677,"[12887] Rodaja C/Placa #G3-LD 3"" Plana Gi *12887*",6.0,119.83,4HGFFI 181137,NaT,<NA>,Irma Carvajal Flores
638,1102,327,P00316 (4HGFFI 179589),2024-01-22,5387,Home Depot Mexico,12677,"[12887] Rodaja C/Placa #G3-LD 3"" Plana Gi *12887*",9.0,119.83,4HGFFI 179589,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
8428,13251,F1-VS/2024/00325,2024-01-25,49710,16.0,234.0,Irma Carvajal Flores,12677,"Rodaja C/Placa #G3-LD 3"" Plana Gi *12887*"

-----> product_id 7945
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
563,1182,368,P00357 (36925),2024-01-24,5378,Maderas Dimar,7945,"[74284] Torn. Conector JCB 1/4"" 20x70mm #3427 ...",50.0,3.89,36925,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
1361,2532,F1-CC/2024/00268,2024-01-06,9244,40.0,4.52,Leticia Terán Salinas,7945,"Torn. Conector JCB 1/4"" 20x70mm #3427 *74284*"

-----> product_id 10527
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
564,1178,367,P00356 (C 261591),2024-01-24,5321,El Gran Tlapalero,10527,[1418] Chapa Ph P/Cajon #21-C #1 *1418*,12.0,44.19,C 261591,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
425,951,F2-CC/2024/00108,2024-01-04,3485,2.0,71.92,Nadia Santos Nava,10527,Chapa Ph P/Cajon #21-C #1 *1418*
2468,4149,F2-CC/2024/00539,2024-01-10,15111,1.0,71.92,Nadia Santos Nava,10527,Chapa Ph P/Cajon #21-C #1 *1418*
3573,5864,F2-CC/2024/00751,2024-01-12,21502,1.0,71.92,Karla Jaqueline Rivera Hernández,10527,Chapa Ph P/Cajon #21-C #1 *1418*
4535,7440,F2-CC/2024/00940,2024-01-16,27483,2.0,71.92,Karla Jaqueline Rivera Hernández,10527,Chapa Ph P/Cajon #21-C #1 *1418*
5150,8307,F2-CC/2024/01062,2024-01-17,30751,1.0,71.92,Nadia Santos Nava,10527,Chapa Ph P/Cajon #21-C #1 *1418*
7349,11622,F1-VS/2024/00290,2024-01-23,43281,1.0,102.26,Mayra Angelica Parada Manjarrez,10527,Chapa Ph P/Cajon #21-C #1 *1418*

-----> product_id 14075
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
567,1176,365,P00354 (B 83477),2024-01-23,5290,Maria Reyna Navarrete Cortez,14075,[40032] Triplay Birch 5/8 4'*8' *40032*,3.0,615.51,B 83477,NaT,<NA>,Mayra Angelica Parada Manjarrez
1009,697,259,P00248 (B 83459),2024-01-17,5290,Maria Reyna Navarrete Cortez,14075,[40032] Triplay Birch 5/8 4'*8' *40032*,2.0,615.51,B 83459,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
5230,8413,F1-VS/2024/00200,2024-01-17,31110,5.0,960.6,Mayra Angelica Parada Manjarrez,14075,Triplay Birch 5/8 4'*8' *40032*

-----> product_id 7671
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
570,1172,362,P00351 (WA 12978),2024-01-23,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7671,[3996] Pija C/Pl 12*3 Smpfz (1800P/C) C#42 *3996*,1000.0,0.81,WA 12978,NaT,<NA>,Reyna Arriaga Flores
1055,634,242,P00231 (WA 12872),2024-01-16,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7671,[3996] Pija C/Pl 12*3 Smpfz (1800P/C) C#42 *3996*,100.0,0.81,WA 12872,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
7211,11435,F1-CC/2024/01128,2024-01-23,42653,200.0,2.32,Reyna Arriaga Flores,7671,Pija C/Pl 12*3 Smpfz (1800P/C) C#42 *3996*

-----> product_id 28511
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
580,1162,358,P00347 (FCO 9404750),2024-01-23,5318,Soluciones En Madera El Roble,28511,"[1781] Morillo 3-4"" x 10 *1781*",4.0,168.11,FCO 9404750,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
7139,11349,F2-VS/2024/00170,2024-01-23,42339,3.0,511.0,Brenda Luz Acosta Lopez,28511,"Morillo 3-4"" x 10 *1781*"

-----> product_id 12026
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
587,1155,351,P00340 (9001035810),2024-01-23,5312,Refrigeracion Y Accesorios,12026,[918] Coilcleaner Adesa Limpieza Acido 3.7L *918*,10.0,113.16,9001035810,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
5877,9281,F1-VS/2024/00236,2024-01-18,34546,10.0,172.0,Irma Carvajal Flores,12026,Coilcleaner Adesa Limpieza Acido 3.7L *918*
7743,12179,F1-VS/2024/00302,2024-01-24,45447,1.0,180.0,Irma Carvajal Flores,12026,Coilcleaner Adesa Limpieza Acido 3.7L *918*

-----> product_id 14233
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
591,1150,346,P00335 (PA 61442),2024-01-22,5335,Casa Myers,14233,[18579] Cierra Puerta Ph #1406-AN #3480 *18579*,10.0,833.79,PA 61442,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
7050,11089,F1-VS/2024/00282,2024-01-22,41196,5.0,1410.66,Irma Carvajal Flores,14233,Cierra Puerta Ph #1406-AN #3480 *18579*

-----> product_id 11435
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
612,1128,340,P00329 (C 261663),2024-01-22,5321,El Gran Tlapalero,11435,[27003] Silicón Negro D/Uso General F109 Sista...,10.0,87.15,C 261663,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
6668,10594,F1-VS/2024/00263,2024-01-22,39509,10.0,113.72,Mayra Angelica Parada Manjarrez,11435,Silicón Negro D/Uso General F109 Sista *27003*

-----> product_id 11928
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
624,1117,334,P00323 (C 261588),2024-01-22,5321,El Gran Tlapalero,11928,[1426] Chapa P/Cajon Ph #250-C Cañ Largo C #33...,30.0,94.93,C 261588,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
1822,3195,F2-CC/2024/00406,2024-01-08,11748,1.0,163.43,Yolanda Alejandra Rodriguez González,11928,Chapa P/Cajon Ph #250-C Cañ Largo C #33 *1426*
6910,10917,F1-VS/2024/00273,2024-01-22,40603,15.0,203.0,Mayra Angelica Parada Manjarrez,11928,Chapa P/Cajon Ph #250-C Cañ Largo C #33 *1426*
9988,16188,F2-CC/2024/02108,2024-01-31,61450,12.0,163.43,Yolanda Alejandra Rodriguez González,11928,Chapa P/Cajon Ph #250-C Cañ Largo C #33 *1426*

-----> product_id 7543
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
648,1092,321,P00310 (WA 12941),2024-01-20,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7543,"[9364] Rondana Neopreno 1/4"" C#176 *9364*",113.0,0.2,WA 12941,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
6177,9727,F1-VS/2024/00244,2024-01-19,36165,150.0,0.6,Irma Carvajal Flores,7543,"Rondana Neopreno 1/4"" C#176 *9364*"

-----> product_id 28461
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
753,983,305,P00294 (MX 4146084),2024-01-19,5161,Uline Shipping Supplies,28461,"[1620] Grifo Giratorio de 10"" *1620*",2.0,4446.31,MX 4146084,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
6288,9861,F2-VS/2024/00151,2024-01-19,36626,2.0,5820.52,Yamilet Blanco Salas,28461,"Grifo Giratorio de 10"" *1620*"

-----> product_id 28462
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
793,943,303,P00292 (2000005305184095F),2024-01-19,5128,Mercado Libre,28462,[1622] Cespol P/lavabo Urrea 207 Cromo *1622*,5.0,688.79,2000005305184095F,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
6274,9859,F2-VS/2024/00150,2024-01-19,36607,5.0,1227.16,Yamilet Blanco Salas,28462,Cespol P/lavabo Urrea 207 Cromo *1622*

-----> product_id 11036
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
802,934,297,P00286 (4HGFFI 179132),2024-01-19,5387,Home Depot Mexico,11036,[56076] Pila D/Boton CR2032 Energizer Paq 2 Pz...,22.0,66.38,4HGFFI 179132,NaT,<NA>,Irma Carvajal Flores
1279,417,177,P00166 (4HGFFI 175877),2024-01-12,5387,Home Depot Mexico,11036,[56076] Pila D/Boton CR2032 Energizer Paq 2 Pz...,8.0,66.38,4HGFFI 175877,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
5692,9005,F1-VS/2024/00229,2024-01-18,33593,8.0,89.87,Mayra Angelica Parada Manjarrez,11036,Pila D/Boton CR2032 Energizer Paq 2 Pzs *56076*
6159,9707,F1-VS/2024/00243,2024-01-19,36095,22.0,89.87,Mayra Angelica Parada Manjarrez,11036,Pila D/Boton CR2032 Energizer Paq 2 Pzs *56076*

-----> product_id 12756
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
922,813,290,P00279 (2000005281980027B),2024-01-18,5128,Mercado Libre,12756,[26164] Pila Panasonic Lto Crp2 *26164*,17.0,151.73,2000005281980027B,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
2027,3399,F2-VS/2024/00038,2024-01-08,12482,8.0,245.56,Brenda Luz Acosta Lopez,12756,Pila Panasonic Lto Crp2 *26164*
5906,9410,F2-VS/2024/00136,2024-01-19,35028,7.0,245.56,Brenda Luz Acosta Lopez,12756,Pila Panasonic Lto Crp2 *26164*

-----> product_id 26819
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
947,782,284,P00273 (4HGFFI 177738),2024-01-18,5387,Home Depot Mexico,26819,[4631] Pegamento Bco. Resistol 850 1Lt *4631*,7.0,154.31,4HGFFI 177738,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
4605,7521,F1-VS/2024/00175,2024-01-16,27797,7.0,231.46,Mayra Angelica Parada Manjarrez,26819,Pegamento Bco. Resistol 850 1Lt *4631*

-----> product_id 26821
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
948,783,284,P00273 (4HGFFI 177738),2024-01-18,5387,Home Depot Mexico,26821,[4625] Pegamento D/Contacto 5000 1Lt. *4625*,4.0,262.93,4HGFFI 177738,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
4607,7521,F1-VS/2024/00175,2024-01-16,27799,4.0,394.4,Mayra Angelica Parada Manjarrez,26821,Pegamento D/Contacto 5000 1Lt. *4625*

-----> product_id 13811
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
956,771,281,P00270 (B 83475),2024-01-18,5290,Maria Reyna Navarrete Cortez,13811,[3651] Triplay Pino 1/2 4'*8' 1/Cara *3651*,22.0,443.34,B 83475,NaT,<NA>,Irma Carvajal Flores
1011,699,259,P00248 (B 83459),2024-01-17,5290,Maria Reyna Navarrete Cortez,13811,[3651] Triplay Pino 1/2 4'*8' 1/Cara *3651*,19.0,443.34,B 83459,NaT,<NA>,Mayra Angelica Parada Manjarrez
1438,246,139,P00128 (B 83329),2024-01-10,5290,Maria Reyna Navarrete Cortez,13811,[3651] Triplay Pino 1/2 4'*8' 1/Cara *3651*,4.0,443.34,B 83329,NaT,<NA>,Irma Carvajal Flores
1549,132,89,P00078 (B 83278),2024-01-08,5290,Maria Reyna Navarrete Cortez,13811,[3651] Triplay Pino 1/2 4'*8' 1/Cara *3651*,5.0,443.34,B 83278,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
580,1156,F1-VS/2024/00015,2024-01-04,4210,6.0,750.9,Mayra Angelica Parada Manjarrez,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*
2365,3920,F1-VS/2024/00097,2024-01-09,14278,6.0,673.0,Irma Carvajal Flores,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*
3666,5977,F1-VS/2024/00152,2024-01-12,21898,2.0,720.0,Irma Carvajal Flores,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*
4884,8003,F1-VS/2024/00191,2024-01-17,29659,20.0,640.0,Irma Carvajal Flores,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*
5236,8417,F1-VS/2024/00203,2024-01-17,31127,4.0,640.0,Irma Carvajal Flores,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*
6176,9727,F1-VS/2024/00244,2024-01-19,36164,18.0,625.0,Irma Carvajal Flores,13811,Triplay Pino 1/2 4'*8' 1/Cara *3651*

-----> product_id 14147
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
957,772,281,P00270 (B 83475),2024-01-18,5290,Maria Reyna Navarrete Cortez,14147,[3637] Triplay Pino 3/4 4'*8' 1/Cara *3637*,6.0,609.41,B 83475,NaT,<NA>,Irma Carvajal Flores
1131,566,212,P00201 (MPIFCO 716),2024-01-15,5296,Madereria Pichonchas,14147,[3637] Triplay Pino 3/4 4'*8' 1/Cara *3637*,10.0,646.55,MPIFCO 716,NaT,<NA>,Irma Carvajal Flores
1273,422,180,P00169 (B 83355),2024-01-12,5290,Maria Reyna Navarrete Cortez,14147,[3637] Triplay Pino 3/4 4'*8' 1/Cara *3637*,6.0,544.44,B 83355,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
3128,5112,F1-VS/2024/00126,2024-01-11,18778,2.0,1066.82,Mayra Angelica Parada Manjarrez,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*
3130,5113,F1-VS/2024/00127,2024-01-11,18782,4.0,969.85,Mayra Angelica Parada Manjarrez,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*
3617,5924,F1-VS/2024/00146,2024-01-12,21712,10.0,1330.6,Mayra Angelica Parada Manjarrez,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*
5237,8417,F1-VS/2024/00203,2024-01-17,31128,4.0,905.0,Irma Carvajal Flores,14147,Triplay Pino 3/4 4'*8' 1/Cara *3637*

-----> product_id 28477
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
985,741,269,P00258 (FAOMXPOS 22090685),2024-01-17,14806,OPERADORA OMX SA DE CV,28477,[1706] Silla Ejecutiva Olmo Negro *1706*,3.0,2585.34,FAOMXPOS 22090685,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
10048,16263,F1-VS/2024/00360,2024-01-31,61704,1.0,3930.0,Irma Carvajal Flores,28477,Silla Ejecutiva Olmo Negro *1706*

-----> product_id 13636
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
989,737,266,P00255 (A 22185),2024-01-17,5264,Maria Teresa Quezada Hernandez,13636,[13756] Tabla Americana 1x12x10 *13756*,8.0,327.59,A 22185,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
582,1156,F1-VS/2024/00015,2024-01-04,4212,10.0,640.05,Mayra Angelica Parada Manjarrez,13636,Tabla Americana 1x12x10 *13756*
2381,3950,F1-VS/2024/00102,2024-01-09,14373,8.0,541.82,Mayra Angelica Parada Manjarrez,13636,Tabla Americana 1x12x10 *13756*
5938,9424,F1-VS/2024/00240,2024-01-19,35122,1.0,534.04,Mayra Angelica Parada Manjarrez,13636,Tabla Americana 1x12x10 *13756*

-----> product_id 14777
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1013,691,256,P00245 (SL 6785),2024-01-17,5181,Vector De Baja California,14777,"[20703] Usgi Radar 2x2x5/8"" LST *20703*",2.0,1607.95,SL 6785,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

Empty DataFrame
Columns: [fact_doc_id, name, invoice_date, fact_line_id, quantity, price_unit, salesperson_name, product_id, product_name]
Index: []

-----> product_id 13283
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1015,690,255,P00244 (B 83432),2024-01-17,5290,Maria Reyna Navarrete Cortez,13283,[3763] Triplay Caoba 1/8 4'*8' *3763*,5.0,270.27,B 83432,NaT,<NA>,Irma Carvajal Flores
1127,574,215,P00204 (B 83363),2024-01-15,5290,Maria Reyna Navarrete Cortez,13283,[3763] Triplay Caoba 1/8 4'*8' *3763*,5.0,270.27,B 83363,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
4883,7927,F1-VS/2024/00190,2024-01-17,29222,10.0,405.0,Irma Carvajal Flores,13283,Triplay Caoba 1/8 4'*8' *3763*

-----> product_id 9946
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1016,689,254,P00243 (BBABA 590633),2024-01-17,5239,Tiendas Soriana,9946,"[2310] Pila duracell ""C"" *2310*",50.0,30.9,BBABA 590633,NaT,<NA>,Irma Carvajal Flores
1017,688,253,P00242 (BBACF 264682),2024-01-17,5239,Tiendas Soriana,9946,"[2310] Pila duracell ""C"" *2310*",100.0,30.9,BBACF 264682,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
4881,7923,F1-VS/2024/00189,2024-01-17,29210,150.0,46.09,Irma Carvajal Flores,9946,"Pila duracell ""C"" *2310*"

-----> product_id 11948
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1052,636,243,P00232 (C 261179),2024-01-16,5321,El Gran Tlapalero,11948,[1424] Chapa P/Cajon Ph #250-CH Cañ Chico C #3...,24.0,92.15,C 261179,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
5065,8242,F1-VS/2024/00195,2024-01-17,30492,12.0,165.0,Mayra Angelica Parada Manjarrez,11948,Chapa P/Cajon Ph #250-CH Cañ Chico C #31 *1424*
7053,11094,F1-VS/2024/00283,2024-01-22,41211,5.0,165.0,Irma Carvajal Flores,11948,Chapa P/Cajon Ph #250-CH Cañ Chico C #31 *1424*
7723,12167,F1-VS/2024/00300,2024-01-24,45396,7.0,140.0,Irma Carvajal Flores,11948,Chapa P/Cajon Ph #250-CH Cañ Chico C #31 *1424*
7868,12362,F1-VS/2024/00311,2024-01-24,46124,1.0,203.92,Irma Carvajal Flores,11948,Chapa P/Cajon Ph #250-CH Cañ Chico C #31 *1424*
9561,15420,F1-VS/2024/00344,2024-01-30,58234,25.0,165.0,Irma Carvajal Flores,11948,Chapa P/Cajon Ph #250-CH Cañ Chico C #31 *1424*

-----> product_id 28424
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1056,623,241,P00230 (2000005246690935B),2024-01-16,5128,Mercado Libre,28424,[1522] Mandil blanco pvc 1.10m x 70cm *1522*,25.0,154.31,2000005246690935B,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
4052,6762,F2-VS/2024/00108,2024-01-15,25025,25.0,285.0,Yamilet Blanco Salas,28424,Mandil blanco pvc 1.10m x 70cm *1522*

-----> product_id 13842
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1058,622,240,P00229 (36767),2024-01-16,5378,Maderas Dimar,13842,[11143] Pistola P/Pintar Devilbis MGQ-500 *11143*,2.0,488.03,36767,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
757,1475,F1-VS/2024/00021,2024-01-05,5431,1.0,749.79,Mayra Angelica Parada Manjarrez,13842,Pistola P/Pintar Devilbis MGQ-500 *11143*

-----> product_id 28443
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1061,617,238,P00227 (W0000456606B),2024-01-16,5157,Ferre-Pat,28443,"[1585] Mini Esmeriladora 4 1/2"" 6130-33 Milwau...",1.0,1452.59,W0000456606B,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
4487,7356,F2-VS/2024/00118,2024-01-16,27204,1.0,4388.86,Yamilet Blanco Salas,28443,"Mini Esmeriladora 4 1/2"" 6130-33 Milwaukee *1585*"

-----> product_id 28442
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1062,618,238,P00227 (W0000456606B),2024-01-16,5157,Ferre-Pat,28442,"[1582] Rotomartillo SDS-Plus 1-1/32"" 5386-21 M...",1.0,3730.17,W0000456606B,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
4486,7356,F2-VS/2024/00118,2024-01-16,27203,1.0,4388.86,Yamilet Blanco Salas,28442,"Rotomartillo SDS-Plus 1-1/32"" 5386-21 Milwauke..."

-----> product_id 7640
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1068,610,235,P00224 (WA 12864),2024-01-16,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7640,[3984] Pija C/Pl 10*3 Smpfz (3000P/C) #34 *3984*,100.0,0.72,WA 12864,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
1911,3291,F2-CC/2024/00415,2024-01-08,12085,6.0,1.17,Patricia Flores Pantaleón,7640,Pija C/Pl 10*3 Smpfz (3000P/C) #34 *3984*

-----> product_id 7545
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1069,611,235,P00224 (WA 12864),2024-01-16,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7545,"[3975] Pija C/Pl 10*1 1/2"" Smpfz (4000P/C) C#3...",600.0,0.38,WA 12864,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
2241,3802,F1-VS/2024/00088,2024-01-09,13847,2.0,0.62,Irma Carvajal Flores,7545,"Pija C/Pl 10*1 1/2"" Smpfz (4000P/C) C#30 *3975*"
6859,10862,F1-VS/2024/00269,2024-01-22,40386,500.0,0.62,Mayra Angelica Parada Manjarrez,7545,"Pija C/Pl 10*1 1/2"" Smpfz (4000P/C) C#30 *3975*"

-----> product_id 28393
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1097,608,232,P00221 (W0000456606),2024-01-16,5157,Ferre-Pat,28393,[24704] Puntas Magnéticas Milwaukee 48-32-4564...,4.0,119.61,W0000456606,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
4426,7211,F1-VS/2024/00167,2024-01-15,26623,10.0,709.91,Mayra Angelica Parada Manjarrez,28393,Puntas Magnéticas Milwaukee 48-32-4564 *24704*

-----> product_id 26811
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1109,596,228,P00217 (AZG 3299875),2024-01-15,5266,Costco De Mexico,26811,[47500] Paquete Pilas AAA (40 pz) Duracell *47...,2.0,322.63,AZG 3299875,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
3650,5961,F1-VS/2024/00148,2024-01-12,21841,2.0,576.0,Yamilet Blanco Salas,26811,Paquete Pilas AAA (40 pz) Duracell *47500*

-----> product_id 13453
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1111,591,226,P00215 (LA 36607),2024-01-15,5143,Fymsa Baja Sur,13453,[1587] Cemento Gris Bulto (50kg) CE *1587*,1.0,322.7,LA 36607,NaT,<NA>,Mayra Angelica Parada Manjarrez
1493,190,109,P00098 (SJ 27023),2024-01-09,5143,Fymsa Baja Sur,13453,[1587] Cemento Gris Bulto (50kg) CE *1587*,2.0,322.7,SJ 27023,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
2022,3397,F2-VS/2024/00037,2024-01-08,12473,2.0,470.44,Yamilet Blanco Salas,13453,Cemento Gris Bulto (50kg) CE *1587*
5232,8415,F1-VS/2024/00202,2024-01-17,31116,2.0,461.95,Mayra Angelica Parada Manjarrez,13453,Cemento Gris Bulto (50kg) CE *1587*
5644,8952,F1-VS/2024/00224,2024-01-18,33364,2.0,472.72,Mayra Angelica Parada Manjarrez,13453,Cemento Gris Bulto (50kg) CE *1587*
6880,10862,F1-VS/2024/00269,2024-01-22,40407,1.0,461.95,Mayra Angelica Parada Manjarrez,13453,Cemento Gris Bulto (50kg) CE *1587*

-----> product_id 26699
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1113,590,225,P00214 (MPIFCO 852),2024-01-15,5296,Madereria Pichonchas,26699,[5877] Pegamento Titebond II Premiun Azul 1L *...,2.0,219.83,MPIFCO 852,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

Empty DataFrame
Columns: [fact_doc_id, name, invoice_date, fact_line_id, quantity, price_unit, salesperson_name, product_id, product_name]
Index: []

-----> product_id 27394
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1120,580,218,P00207 (4HGFFI 177069),2024-01-15,5387,Home Depot Mexico,27394,[247181] Pinza electricista Klein tool #KT215 ...,1.0,625.0,4HGFFI 177069,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
3089,5066,F1-VS/2024/00123,2024-01-11,18618,1.0,950.0,Mayra Angelica Parada Manjarrez,27394,Pinza electricista Klein tool #KT215 CE *247181*

-----> product_id 28429
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1124,576,216,P00205 (CS1VC1FA 36984),2024-01-15,5222,Pro Riego,28429,[1533] Boquilla Ajustable de 4 Pies (1.2m) Con...,2.0,27.62,CS1VC1FA 36984,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
9566,15421,F1-VS/2024/00345,2024-01-30,58246,1.0,55.0,Irma Carvajal Flores,28429,Boquilla Ajustable de 4 Pies (1.2m) Con Filtro...

-----> product_id 28430
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1125,577,216,P00205 (CS1VC1FA 36984),2024-01-15,5222,Pro Riego,28430,[1537] Boquilla Ajustable De 8 Pies (2.40m) Co...,2.0,27.62,CS1VC1FA 36984,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
9567,15421,F1-VS/2024/00345,2024-01-30,58247,1.0,55.0,Irma Carvajal Flores,28430,Boquilla Ajustable De 8 Pies (2.40m) Con Filtr...

-----> product_id 28431
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1126,578,216,P00205 (CS1VC1FA 36984),2024-01-15,5222,Pro Riego,28431,[1538] Boquilla Ajustable De 6 Pies (1.8m) Con...,2.0,27.62,CS1VC1FA 36984,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
9568,15421,F1-VS/2024/00345,2024-01-30,58248,1.0,55.0,Irma Carvajal Flores,28431,Boquilla Ajustable De 6 Pies (1.8m) Con Filtro...

-----> product_id 14374
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1130,565,212,P00201 (MPIFCO 716),2024-01-15,5296,Madereria Pichonchas,14374,"[5902] TABLA DE ALDER 1"" CAMA *5902*",4.0,1206.9,MPIFCO 716,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
3858,6361,F1-VS/2024/00159,2024-01-13,23483,4.0,2363.8,Mayra Angelica Parada Manjarrez,14374,"TABLA DE ALDER 1"" CAMA *5902*"

-----> product_id 14772
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1135,570,212,P00201 (MPIFCO 716),2024-01-15,5296,Madereria Pichonchas,14772,[16313] Pegamento Titebond Verde1L *16313*,3.0,245.69,MPIFCO 716,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
3867,6361,F1-VS/2024/00159,2024-01-13,23492,3.0,409.0,Mayra Angelica Parada Manjarrez,14772,Pegamento Titebond Verde1L *16313*

-----> product_id 7823
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1141,554,206,P00195 (WA 12852),2024-01-15,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7823,"[72083] Pija C/Plana 14 x 1"" A Inox CE *72083*",50.0,1.48,WA 12852,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
4222,6947,F2-VS/2024/00113,2024-01-15,25727,50.0,2.88,Yamilet Blanco Salas,7823,"Pija C/Plana 14 x 1"" A Inox CE *72083*"

-----> product_id 7983
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1142,555,206,P00195 (WA 12852),2024-01-15,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7983,"[4428] Pija C/Plana 14x2"" Acero Inox.. *4428*",40.0,2.61,WA 12852,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
4224,6947,F2-VS/2024/00113,2024-01-15,25729,40.0,4.25,Yamilet Blanco Salas,7983,"Pija C/Plana 14x2"" Acero Inox.. *4428*"

-----> product_id 7957
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1143,556,206,P00195 (WA 12852),2024-01-15,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7957,"[25865] Pija C/Plana 14x2 1/2"" Acero Inox CE *...",40.0,2.94,WA 12852,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
4223,6947,F2-VS/2024/00113,2024-01-15,25728,40.0,5.14,Yamilet Blanco Salas,7957,"Pija C/Plana 14x2 1/2"" Acero Inox CE *25865*"

-----> product_id 28433
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1144,557,206,P00195 (WA 12852),2024-01-15,5221,Distribuidor Mayorista De Tornillos De Yucatan...,28433,"[40925] Pija Cabeza Plana Inox. 14 X 1 1/2"" CE...",40.0,1.96,WA 12852,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
4225,6947,F2-VS/2024/00113,2024-01-15,25730,40.0,3.1,Yamilet Blanco Salas,28433,"Pija Cabeza Plana Inox. 14 X 1 1/2"" CE *40925*"

-----> product_id 13371
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1155,546,198,P00187 (B 83392),2024-01-13,5290,Maria Reyna Navarrete Cortez,13371,[12749] Triplay Pino 1/4 4'*8' 1/Cara *12749*,2.0,272.87,B 83392,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
3668,5978,F1-VS/2024/00153,2024-01-12,21902,2.0,409.31,Irma Carvajal Flores,13371,Triplay Pino 1/4 4'*8' 1/Cara *12749*

-----> product_id 14386
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1158,542,197,P00186 (A 103781),2024-01-13,5352,Luz Raquel Rodriguez Montoya,14386,[12861] Tablon Americano 2*12*16 *12861*,2.0,1241.38,A 103781,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
3645,5961,F1-VS/2024/00148,2024-01-12,21836,2.0,2068.97,Yamilet Blanco Salas,14386,Tablon Americano 2*12*16 *12861*

-----> product_id 28117
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1159,539,196,P00185 (BLEVIFA 014922),2024-01-13,5174,Campos Reyeros Y Cia,28117,[16725] Thinner Americano 4 lts *16725*,4.0,303.45,BLEVIFA 014922,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
6481,10208,F1-VS/2024/00258,2024-01-20,38059,2.0,455.17,Mayra Angelica Parada Manjarrez,28117,Thinner Americano 4 lts *16725*

-----> product_id 28422
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1165,533,191,P00180 (FA0 47818),2024-01-12,5250,El Fluxometro De Cabos,28422,[1521] Tapa Ciega Coladera 1342.282 RC-018 *1521*,6.0,163.34,FA0 47818,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
3792,6281,F2-VS/2024/00100,2024-01-13,23190,6.0,212.07,Yamilet Blanco Salas,28422,Tapa Ciega Coladera 1342.282 RC-018 *1521*

-----> product_id 13638
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1169,529,187,P00176 (C 260333),2024-01-12,5321,El Gran Tlapalero,13638,[11816] Chapa Yale P/Entrada Ball Cm 80049 *11...,10.0,350.24,C 260333,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
2813,4583,F2-VS/2024/00063,2024-01-10,16692,6.0,625.0,Brenda Luz Acosta Lopez,13638,Chapa Yale P/Entrada Ball Cm 80049 *11816*
4716,7638,F2-CC/2024/00969,2024-01-16,28208,1.0,580.34,Karla Jaqueline Rivera Hernández,13638,Chapa Yale P/Entrada Ball Cm 80049 *11816*

-----> product_id 28279
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1290,405,167,P00156 (CSL202400126),2024-01-11,5226,Jorge Arturo Chavarria Fernandez,28279,[11058] Liquido Limpiador Foam Cleaner 4Lt *11...,2.0,189.66,CSL202400126,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
3225,5204,F2-VS/2024/00080,2024-01-11,19135,2.0,235.19,Yamilet Blanco Salas,28279,Liquido Limpiador Foam Cleaner 4Lt *11058*

-----> product_id 14841
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1299,394,163,P00152 (36623),2024-01-11,5378,Maderas Dimar,14841,[71335] Bisagra Recta Cierre Lento #315.07.023...,3.0,100.45,36623,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
597,1165,F1-VS/2024/00016,2024-01-04,4253,15.0,174.68,Mayra Angelica Parada Manjarrez,14841,Bisagra Recta Cierre Lento #315.07.023 *71335*

-----> product_id 28409
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1311,383,154,P00143 (BJ 181572),2024-01-11,5294,Fierro Y Lamina Construccion,28409,"[36794] Varilla Corrugada 5/8"" *36794*",5.0,417.26,BJ 181572,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
2974,4895,F2-VS/2024/00069,2024-01-11,18019,5.0,572.85,Yamilet Blanco Salas,28409,"Varilla Corrugada 5/8"" *36794*"

-----> product_id 14769
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1439,244,138,P00127 (WAI 53269),2024-01-10,5175,Cia Sherwin Williams,14769,[41555] Kem-Tone Base Deep Mate SW-7019 *41555*,3.0,1818.95,WAI 53269,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
1289,2467,F1-VS/2024/00036,2024-01-06,9007,1.0,3671.0,Irma Carvajal Flores,14769,Kem-Tone Base Deep Mate SW-7019 *41555*
5566,8894,F1-VS/2024/00222,2024-01-18,33114,3.0,3671.0,Irma Carvajal Flores,14769,Kem-Tone Base Deep Mate SW-7019 *41555*
9570,15421,F1-VS/2024/00345,2024-01-30,58250,3.0,3671.0,Irma Carvajal Flores,14769,Kem-Tone Base Deep Mate SW-7019 *41555*

-----> product_id 26810
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1446,236,134,P00123 (AZG 3298252),2024-01-10,5266,Costco De Mexico,26810,[47501] Paquete Pilas AA (40 pz) Duracell *47501*,2.0,322.63,AZG 3298252,NaT,<NA>,Brenda Luz Acosta Lopez
1448,235,133,P00122 (AZG 3298248),2024-01-10,5266,Costco De Mexico,26810,[47501] Paquete Pilas AA (40 pz) Duracell *47501*,1.0,322.63,AZG 3298248,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
2339,3893,F2-VS/2024/00050,2024-01-09,14180,2.0,751.21,Yamilet Blanco Salas,26810,Paquete Pilas AA (40 pz) Duracell *47501*
2342,3901,F2-VS/2024/00051,2024-01-09,14203,1.0,751.21,Yamilet Blanco Salas,26810,Paquete Pilas AA (40 pz) Duracell *47501*

-----> product_id 10726
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1447,237,134,P00123 (AZG 3298252),2024-01-10,5266,Costco De Mexico,10726,[56321] Pila Duracell 9V CE *56321*,16.0,53.77,AZG 3298252,NaT,<NA>,Brenda Luz Acosta Lopez
1449,234,132,P00121 (AZG 3298243),2024-01-10,5266,Costco De Mexico,10726,[56321] Pila Duracell 9V CE *56321*,32.0,53.77,AZG 3298243,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
2338,3892,F2-VS/2024/00049,2024-01-09,14177,50.0,80.82,Yamilet Blanco Salas,10726,Pila Duracell 9V CE *56321*

-----> product_id 28073
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1466,217,125,P00114 (SJ 36469),2024-01-10,5369,Acyma Del Noroeste,28073,[19063] Tablaroca verde 1/2 *19063*,40.0,296.62,SJ 36469,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
2170,3687,F2-VS/2024/00044,2024-01-09,13469,40.0,430.61,Yamilet Blanco Salas,28073,Tablaroca verde 1/2 *19063*

-----> product_id 28208
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1481,202,116,P00105 (2000005258548521C),2024-01-09,5128,Mercado Libre,28208,[1316] Jgo Carbones P/lijadora Dwe6421/Dwe6411...,5.0,99.14,2000005258548521C,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
1616,2992,F2-VS/2024/00022,2024-01-08,10996,3.0,172.62,Yamilet Blanco Salas,28208,Jgo Carbones P/lijadora Dwe6421/Dwe6411 *1316*

-----> product_id 14764
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1482,201,115,P00104 (2000005246690935),2024-01-09,5128,Mercado Libre,14764,[24334] Serie de 500 luces 25Mts Leds *24334*,1.0,4137.93,2000005246690935,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
1660,3052,F2-VS/2024/00027,2024-01-08,11192,10.0,746.0,Yamilet Blanco Salas,14764,Serie de 500 luces 25Mts Leds *24334*
8271,13115,F2-VS/2024/00192,2024-01-25,49196,2.0,746.0,Yamilet Blanco Salas,14764,Serie de 500 luces 25Mts Leds *24334*

-----> product_id 7481
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1486,197,112,P00101 (WA 12776),2024-01-09,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7481,[2540] Rondana Plana 3/16 C#184 *2540*,200.0,0.16,WA 12776,NaT,<NA>,Irma Carvajal Flores
1488,194,111,P00100 (XA 21547),2024-01-09,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7481,[2540] Rondana Plana 3/16 C#184 *2540*,800.0,0.17,XA 21547,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
330,712,F1-CC/2024/00060,2024-01-03,2541,10.0,0.34,Viviana Montaño Inzunza,7481,Rondana Plana 3/16 C#184 *2540*
1430,2672,F2-CC/2024/00313,2024-01-06,9728,50.0,0.34,Angela Carrillo Cárdenas,7481,Rondana Plana 3/16 C#184 *2540*
1816,3191,F1-VS/2024/00058,2024-01-08,11732,2800.0,0.34,Irma Carvajal Flores,7481,Rondana Plana 3/16 C#184 *2540*
3270,5452,F2-CC/2024/00701,2024-01-12,20046,10.0,0.34,Patricia Flores Pantaleón,7481,Rondana Plana 3/16 C#184 *2540*
3733,6193,F2-CC/2024/00783,2024-01-13,22900,6.0,0.34,Yolanda Alejandra Rodriguez González,7481,Rondana Plana 3/16 C#184 *2540*
9929,15952,F2-CC/2024/02091,2024-01-30,60417,100.0,0.34,Nadia Santos Nava,7481,Rondana Plana 3/16 C#184 *2540*

-----> product_id 8002
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1489,195,111,P00100 (XA 21547),2024-01-09,5221,Distribuidor Mayorista De Tornillos De Yucatan...,8002,"[5393] Tuerca Hexagonal 3/4"" Hncz (360/Ct) C#2...",1400.0,0.14,XA 21547,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
9,125,F1-CC/2024/00004,2024-01-02,345,2.0,3.6,Gladiz Melisa Galvez Espinoza,8002,"Tuerca Hexagonal 3/4"" Hncz (360/Ct) C#2 *5393*"

-----> product_id 7856
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1490,196,111,P00100 (XA 21547),2024-01-09,5221,Distribuidor Mayorista De Tornillos De Yucatan...,7856,"[5244] Tornillo C/Hexagonal 1/4* 2 1/2"" C#59 *...",150.0,1.3,XA 21547,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
439,974,F2-CC/2024/00114,2024-01-04,3559,6.0,3.05,Patricia Flores Pantaleón,7856,"Tornillo C/Hexagonal 1/4* 2 1/2"" C#59 *5244*"
1818,3191,F1-VS/2024/00058,2024-01-08,11734,250.0,3.6,Irma Carvajal Flores,7856,"Tornillo C/Hexagonal 1/4* 2 1/2"" C#59 *5244*"
5950,9433,F2-VS/2024/00139,2024-01-19,35159,200.0,3.05,Brenda Luz Acosta Lopez,7856,"Tornillo C/Hexagonal 1/4* 2 1/2"" C#59 *5244*"

-----> product_id 26914
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1491,191,110,P00099 (SJ 36460),2024-01-09,5369,Acyma Del Noroeste,26914,[36369] Hoja Tablaroca *36369*,7.0,196.99,SJ 36460,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
2021,3397,F2-VS/2024/00037,2024-01-08,12472,7.0,348.78,Yamilet Blanco Salas,26914,Hoja Tablaroca *36369*

-----> product_id 13057
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1492,192,110,P00099 (SJ 36460),2024-01-09,5369,Acyma Del Noroeste,13057,[7006] Redimix c/21.08 kg *7006*,3.0,213.56,SJ 36460,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
2023,3397,F2-VS/2024/00037,2024-01-08,12474,3.0,563.84,Yamilet Blanco Salas,13057,Redimix c/21.08 kg *7006*
6854,10862,F1-VS/2024/00269,2024-01-22,40381,1.0,552.19,Mayra Angelica Parada Manjarrez,13057,Redimix c/21.08 kg *7006*

-----> product_id 28370
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1518,163,105,P00094 (A 6354),2024-01-09,5269,Proveedora De Pisos Y Sanitarios De Los Cabos,28370,[1401] Boquilla S/Arena Negro*1401*,2.0,142.24,A 6354,NaT,<NA>,Irma Carvajal Flores
1523,162,104,P00093 (E 46983),2024-01-09,5269,Proveedora De Pisos Y Sanitarios De Los Cabos,28370,[1401] Boquilla S/Arena Negro*1401*,1.0,130.17,E 46983,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
2013,3396,F1-VS/2024/00085,2024-01-08,12462,3.0,234.0,Irma Carvajal Flores,28370,Boquilla S/Arena Negro*1401*

-----> product_id 28382
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1531,148,99,P00088 (FACSL 306857),2024-01-09,5351,El Arco Csl,28382,"[1421] Valvula BCE B RSC 3/4"" *1421*",2.0,126.72,FACSL 306857,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
7745,12179,F1-VS/2024/00302,2024-01-24,45449,1.0,195.0,Irma Carvajal Flores,28382,"Valvula BCE B RSC 3/4"" *1421*"

-----> product_id 26743
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1539,141,93,P00082 (C 259178),2024-01-08,5321,El Gran Tlapalero,26743,[55866] Chapa Soprano 30mm Standar G C J1031 *...,40.0,40.07,C 259178,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
1211,2348,F2-VS/2024/00008,2024-01-06,8622,21.0,88.41,Brenda Luz Acosta Lopez,26743,Chapa Soprano 30mm Standar G C J1031 *55866*

-----> product_id 13552
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1545,135,91,P00080 (C 259462),2024-01-08,5321,El Gran Tlapalero,13552,[2489] Chapa Ph P/Perfil Alum #550-AN #585 CE ...,5.0,327.47,C 259462,NaT,<NA>,Brenda Luz Acosta Lopez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
6260,9853,F2-VS/2024/00149,2024-01-19,36574,4.0,530.92,Brenda Luz Acosta Lopez,13552,Chapa Ph P/Perfil Alum #550-AN #585 CE *2489*

-----> product_id 12446
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1550,130,88,P00077 (IWAYYB 12428),2024-01-08,5281,Nueva Wal Mart De Mexico,12446,[10695] Brasso Liquido 200mls *10695*,8.0,151.72,IWAYYB 12428,NaT,<NA>,Irma Carvajal Flores
1551,129,87,P00076 (IWAJY 697677),2024-01-08,5281,Nueva Wal Mart De Mexico,12446,[10695] Brasso Liquido 200mls *10695*,12.0,151.72,IWAJY 697677,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
1985,3376,F1-VS/2024/00078,2024-01-08,12386,20.0,230.0,Irma Carvajal Flores,12446,Brasso Liquido 200mls *10695*

-----> product_id 28354
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1560,120,70,P00063 (C 164865),2024-01-05,5280,DISTRIBUIDORA DE HERRAJES Y ALUMINIO DE LOS CABOS,28354,[1388] Película Decorativa Color Humo AD220-8*...,1.0,2344.8,C 164865,NaT,<NA>,Mayra Angelica Parada Manjarrez

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
1360,2531,F1-VS/2024/00043,2024-01-06,9241,1.0,3098.0,Irma Carvajal Flores,28354,Película Decorativa Color Humo AD220-8*1388*

-----> product_id 12774
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1577,100,65,P00058 (BSJOSFA 286261),2024-01-05,5174,Campos Reyeros Y Cia,12774,[10992] Papel Verde 18*60 YDS TOT12218 Trimaco...,15.0,166.38,BSJOSFA 286261,NaT,Elsa Ivette Diaz Leyva,Karla Jaqueline Rivera Hernández

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
463,995,F2-CC/2024/00121,2024-01-04,3639,5.0,249.57,Karla Jaqueline Rivera Hernández,12774,Papel Verde 18*60 YDS TOT12218 Trimaco *10992*
2561,4276,F2-CC/2024/00557,2024-01-10,15555,1.0,249.57,Karla Jaqueline Rivera Hernández,12774,Papel Verde 18*60 YDS TOT12218 Trimaco *10992*
4037,6739,F2-CC/2024/00847,2024-01-15,24951,1.0,249.57,Nadia Santos Nava,12774,Papel Verde 18*60 YDS TOT12218 Trimaco *10992*
4440,7315,F2-CC/2024/00921,2024-01-16,27024,1.0,249.57,Karla Jaqueline Rivera Hernández,12774,Papel Verde 18*60 YDS TOT12218 Trimaco *10992*
5386,8551,F2-CC/2024/01105,2024-01-17,31630,1.0,249.57,Karla Jaqueline Rivera Hernández,12774,Papel Verde 18*60 YDS TOT12218 Trimaco *10992*
5625,8944,F2-CC/2024/01147,2024-01-18,33301,5.0,249.57,Karla Jaqueline Rivera Hernández,12774,Papel Verde 18*60 YDS TOT12218 Trimaco *10992*
6212,9778,F2-CC/2024/01272,2024-01-19,36334,2.0,249.57,Nadia Santos Nava,12774,Papel Verde 18*60 YDS TOT12218 Trimaco *10992*
7967,12698,F2-CC/2024/01632,2024-01-25,47816,6.0,249.57,Karla Jaqueline Rivera Hernández,12774,Papel Verde 18*60 YDS TOT12218 Trimaco *10992*

-----> product_id 10856
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1612,58,44,P00037 (C 259720),2024-01-03,5321,El Gran Tlapalero,10856,[528] Tope Ph Media Luna #54-C #1464 *528*,50.0,53.93,C 259720,NaT,<NA>,Irma Carvajal Flores

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
849,1579,F1-VS/2024/00028,2024-01-05,5801,125.0,81.36,Irma Carvajal Flores,10856,Tope Ph Media Luna #54-C #1464 *528*
2350,3911,F1-VS/2024/00095,2024-01-09,14241,100.0,81.36,Irma Carvajal Flores,10856,Tope Ph Media Luna #54-C #1464 *528*

-----> product_id 14773
Compra:

,line_id,order_id,order_name,order_date,partner_id,partner_name,product_id_pp,product_name,product_qty,product_cost,partner_fact_ref,partner_fact_date,capturista,vendedora
1617,54,40,P00033 (2000005232684875),2024-01-03,5128,Mercado Libre,14773,[1375] Disco Abrasivo Desbaste Metal 4-1/2x7/8...,25.0,25.14,2000005232684875,NaT,<NA>,Yolanda Alejandra Rodriguez González

Ventas mini_df

,fact_doc_id,name,invoice_date,fact_line_id,quantity,price_unit,salesperson_name,product_id,product_name
708,1374,F2-CC/2024/00177,2024-01-05,5084,20.0,71.5,Yolanda Alejandra Rodriguez González,14773,Disco Abrasivo Desbaste Metal 4-1/2x7/8 B-4426...
6803,10813,F2-CC/2024/01390,2024-01-22,40206,1.0,71.5,Patricia Flores Pantaleón,14773,Disco Abrasivo Desbaste Metal 4-1/2x7/8 B-4426...